cf_billing/DataProcessors/энргСостояниеТочекУчетаМенеджер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>энргСостояниеТочекУчетаМенеджер</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеВыполненияОбязанностейГарантирующегоПоставщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеВыполненияОбязанностейГарантирующегоПоставщика</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбязанностиВыполнены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/DataProcessors/энргСостояниеТочекУчетаМенеджер/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область РеализацияИнтерефейса_ЗаполнениеСхемыЗапроса

// Получает действующие точки и их приборы.
//
// Параметры:
//  Период			-	Дата.
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  КлючПомещения	-	СправочникСсылка.энргКлючиПомещений.
//  ТочкаУчета		-	СправочникСсылка.энргТочкиУчета.
//  ПараметрыОтбора	-	Структура.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ДействующиеТочкиИИхПриборы(Период, Организация, Район, КлючПомещения, ТочкаУчета = Неопределено, ПараметрыОтбора = Неопределено) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжСостояниеТочекУчетаМенеджер") = Неопределено Тогда
				Возврат Обработки["слжСостояниеТочекУчетаМенеджер"].ДействующиеТочкиИИхПриборы(Период,Организация,Район,КлючПомещения,ТочкаУчета,ПараметрыОтбора);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат  						= энргСостояниеТочекУчета.ДействующиеТочкиИИхПриборы(Период, Организация, Район, КлючПомещения, ТочкаУчета, ПараметрыОтбора);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "СостояниеТочекУчетаМенеджер.ДействующиеТочкиИИхПриборы";
		ПараметрыМетода 			= Новый Структура("Период,Организация,Район,КлючПомещения,ТочкаУчета,ПараметрыОтбора", Период,Организация,Район,КлючПомещения,ТочкаУчета,ПараметрыОтбора);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

// Получает действующие точки без прибора учета.
//
// Параметры:
//  Период			-	Дата.
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  КлючПомещения	-	СправочникСсылка.энргКлючиПомещений.
//  ТочкаУчета		-	СправочникСсылка.энргТочкиУчета.
//  ПараметрыОтбора	-	Структура.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ДействующиеТочкиБезПрибораУчета(Период, Организация, Район, КлючПомещения, ТочкаУчета = Неопределено, ПараметрыОтбора = Неопределено) Экспорт
	
	Результат = энргСостояниеТочекУчета.ДействующиеТочкиБезПрибораУчета(Период, Организация, Район, КлючПомещения, ТочкаУчета, ПараметрыОтбора); 	 
	
	Возврат Результат;
	
КонецФункции

// Получает услуги действующих точек.
//
// Параметры:
//  Период			-	Дата.
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  КлючПомещения	-	СправочникСсылка.энргКлючиПомещений.
//  ТочкаУчета		-	СправочникСсылка.энргТочкиУчета.
//  ПараметрыОтбора	-	Структура.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция УслугиДействующихТочек(Период, Организация, Район, КлючПомещения, ТочкаУчета = Неопределено, ПараметрыОтбора = Неопределено) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжСостояниеТочекУчетаМенеджер") = Неопределено Тогда
				Возврат Обработки["слжСостояниеТочекУчетаМенеджер"].ДействующиеТочкиИИхПриборы(Период,Организация,Район,КлючПомещения,ТочкаУчета,ПараметрыОтбора);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат  						= энргСостояниеТочекУчета.УслугиДействующихТочек(Период, Организация, Район, КлючПомещения, ТочкаУчета, ПараметрыОтбора);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "СостояниеТочекУчетаМенеджер.ДействующиеТочкиИИхПриборы";
		ПараметрыМетода 			= Новый Структура("Период,Организация,Район,КлючПомещения,ТочкаУчета,ПараметрыОтбора", Период,Организация,Район,КлючПомещения,ТочкаУчета,ПараметрыОтбора);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

// Получает точки ОРП и их приборы.
//
// Параметры:
//  Период			-	Дата.
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  КлючПомещения	-	СправочникСсылка.энргКлючиПомещений.
//  ТочкаУчета		-	СправочникСсылка.энргТочкиУчета.
//  ПараметрыОтбора	-	Структура.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ТочкиОРПиИхПриборы(Период, Организация, Район, КлючПомещения, ТочкаУчета = Неопределено, ПараметрыОтбора = Неопределено) Экспорт
	Результат = энргСостояниеТочекУчета.ТочкиОРПиИхПриборы(Период, Организация, Район, КлючПомещения, ТочкаУчета, ПараметрыОтбора);
	Возврат Результат;
КонецФункции 

// Получает точки с не выполненными обязанностями гарантирующего поставщика.
//
// Параметры:
//  Период			-	Дата.
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  ДанныеСтроения	-	Структура.
//  ТочкаУчета		-	Структура.
//  ПараметрыОтбора	-	Структура.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
// 
Функция ТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщика(Период, Организация, Район, ДанныеСтроения = Неопределено, ТочкаУчета = Неопределено, ПараметрыОтбора = Неопределено)	Экспорт 
	
	Схема							= Неопределено;
	Параметры 						= Новый Структура;
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация"		, "Организация")	, Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район"			, "Район")			, Неопределено));
	Если НЕ ДанныеСтроения = Неопределено Тогда 
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("ЧастныйСектор", "ЧастныйСектор")	, Неопределено));
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Строение"		, "Строение")		, Неопределено));
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Помещение"	, "Помещение")		, Неопределено));
	КонецЕсли; 
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("ТочкаУчета"	, "ТочкаУчета")		, Неопределено));
	КонецЕсли;
	
	Параметры.Вставить("Период", 			Новый Структура("ИмяПараметра,ТипПараметра", "Период" ,"ТипПараметраГраницаИсключая"));
	Если ТипЗнч(Период) = Тип("Дата") и НЕ ЗначениеЗаполнено(Период) Тогда
		Параметры.Удалить("Период");
	КонецЕсли;
	Параметры.Вставить("ПараметрыВТ", 		ПараметрыВТ);
	
	РегистрыСведений.энргСостояниеВыполненияОбязанностейГарантирующегоПоставщика.ТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщика(Схема, Параметры);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Организация",	Организация);
	ПараметрыЗапроса.Вставить("Район",			Район);
	
	Если НЕ ДанныеСтроения = Неопределено Тогда 
		ПараметрыЗапроса.Вставить("ЧастныйСектор"	, ДанныеСтроения.ЧастныйСектор);
		ПараметрыЗапроса.Вставить("Строение"		, ДанныеСтроения.Строение);
		ПараметрыЗапроса.Вставить("Помещение"		, ДанныеСтроения.Помещение);
	КонецЕсли;	
	
	Если Параметры.Свойство("Период") Тогда
		ПараметрыЗапроса.Вставить("Период",		Период);
	Иначе
		ПараметрыЗапроса.Вставить("Период",		ТекущаяДата());
	КонецЕсли;
	
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыЗапроса.Вставить("ТочкаУчета",	ТочкаУчета);
	КонецЕсли;
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
